{
  "educations": [
    {
      "school":"National Taipei University of Technology, Taiwan",
      "duration": "Sep 2012 - June 2014",
      "degree": "Master Electrical Engineering",
      "content": "Here, I learned OOAD, SQL, PHP, MVC, Angular and more. I also started working in Cloudpe Corp. and learned about how the real life platform is."
    },
    {
      "school":"Czech Technical University, Czech",
      "duration": "Sep 2013 - Feb 2014",
      "degree": "Exchange student",
      "content": "I spent half year in CTU to enjoy a life in eastern Europe. Life there was nice and I continued making a web based video conference system using ThinkPHP, Flash, and Bootstrap."
    },
    {
      "school":"Osaka Institute of Technology, Japan",
      "duration": "Jun 2013 - Aug 2013",
      "degree": "Exchange student",
      "content": "I am lucky enough to have the chance to be an exchange student to OIT, and I learned a lot during the time there. I actually made a drawing robot from scratch. I did the math and equations, design, programs and finally, I assemble all the parts, and in the end, it can draw anything that I wanted, isn't that cool?"
    },
    {
      "school":"National Taipei University of Technology, Taiwan",
      "duration": "Sep 2008 - June 2012",
      "degree": "Bachelor Electrical Engineering",
      "content": "I spend lots of time here thinking about what I want to be in the future. I realized in my third year of university that I wanted to make a difference in the world and the best approach was to dig into the websites, and so I started making web based video conference system using Flash / ActionScript."
    }
  ],
  "careers": [
    {
      "company":"Cloudpe Corp., Taiwan",
      "duration":"Sep 2014 - Present",
      "role": "Full-stack Engineer",
      "jobDescription": [
        "Design and develop new projects.",
        "Research and introduce new technology to improve the performance of the current system.",
        "Lead and guide junior programmer."
      ],
      "achievements": [
        "Solved Red 5 streaming server's disability in streaming multiple mp4 files and reduced server loading.",
        "Increased Red5 video streaming server's performance about 20%.",
        "Introduced Gulp and Webpack automation tools to speed up web development.",
        "Provided WebRTC, SIP, and instant chat room features.",
        "Provided new Lecture video streaming server with HLS features to support cross-platform video browsing.",
        "Provided multiple video streamings in iOS App using Air Native Extension (ANE).",
        "Use React Native to build Lecture One Button Studio App.",
        "Refactored part of VOD platform code base."
      ]
    },
    {
      "company":"Front End Developer Consultant",
      "duration":"Apr 2016 - Jul 2016",
      "role": "Front End Developer Consultant",
      "jobDescription": [
        "Provide consulting to start up for following skills Angular 2, Angular 1.x, Sass, Javascript, PHP."
      ],
      "achievements": []
    },
    {
      "company":"Cloudpe Corp., Taiwan",
      "duration":"Mar 2012 - July 2014",
      "role": "Assistant Software Engineer",
      "jobDescription": [
        "Video conferencing system development.",
        "Assist E-Learning platform development.",
        "Mobile Applications development based on Flash."
      ],
      "achievements": ["Implemented the following features: courses and batches management, student attendance control, timetable, multiple dashboards, user management, school/event calendar, and email integration."]
    }
  ]
}
